<a href="https://colab.research.google.com/github/2403a51218/AI-ASSISTED-CODING/blob/main/Untitled1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

##Data Wrongling steps

In [1]:
import pandas as pd
data={
    "Name": ["Alice", "Bb", "Charlie","David","eve","Alice","charlie"],
    "Age": [25, 34, 30, 40, 65, 25,38],
    "City": ["New York", "London", "hyd", "Paris", "Berlin", "New York", "wgl"],
    "Salary": [50008, 60000, 70000, 80000, 90880,50000, 100000]}
df=pd. DataFrame (data)
print (df)

      Name  Age      City  Salary
0    Alice   25  New York   50008
1       Bb   34    London   60000
2  Charlie   30       hyd   70000
3    David   40     Paris   80000
4      eve   65    Berlin   90880
5    Alice   25  New York   50000
6  charlie   38       wgl  100000

In [2]:
import pandas as pd
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve","Alice","Charlie"],
    "Age": [25, None, 30, 40, None,25,30],
    "City": ["New York", "London", None, "Paris", "Berlin","New York",None],
    "Salary": [50000, 60000, None, 80000, 90000,50000,None]
}

df = pd.DataFrame(data)
print("Original Data:\n", df, "\n")
df = df.dropna(subset=['Salary'])
print(df)
df['Age'] = df['Age'].fillna(df['Age'].mean())
df['City'] = df['City'].fillna("Unknown")
df = df.drop_duplicates()
print(df)

Original Data:
       Name   Age      City   Salary
0    Alice  25.0  New York  50000.0
1      Bob   NaN    London  60000.0
2  Charlie  30.0      None      NaN
3    David  40.0     Paris  80000.0
4      Eve   NaN    Berlin  90000.0
5    Alice  25.0  New York  50000.0
6  Charlie  30.0      None      NaN

    Name   Age      City   Salary
0  Alice  25.0  New York  50000.0
1    Bob   NaN    London  60000.0
3  David  40.0     Paris  80000.0
4    Eve   NaN    Berlin  90000.0
5  Alice  25.0  New York  50000.0
    Name   Age      City   Salary
0  Alice  25.0  New York  50000.0
1    Bob  30.0    London  60000.0
3  David  40.0     Paris  80000.0
4    Eve  30.0    Berlin  90000.0

In [3]:
import pandas as pd
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve","Alice","Charlie"],
    "Age": [25, None, 30, 40, None,25,30],
    "City": ["New York", "London", None, "Paris", "Berlin","New York",None],
    "Salary": [50000, 60000, None, 80000, 90000,50000,None]
}

df = pd.DataFrame(data)
print("Original Data:\n", df, "\n")
df = df.dropna(subset=['Salary'])
print(df)
df['Age'] = df['Age'].fillna(df['Age'].mean())
df['City'] = df['City'].fillna("Unknown")
df = df.drop_duplicates()
print(df)
df = df.rename(columns={"Name": "Employee_Name", "Age": "Employee_Age"})
df['Employee_Age'] = df['Employee_Age'].astype(int)
print(df)
df_filtered = df[df['Salary'] > 60000]   # employees with salary > 60000
print(df)
df['Bonus'] = df['Salary'] * 0.10   # 10% bonus
print(df)
df = df.sort_values(by='Salary', ascending=False)
print(df)
df_group = df.groupby('City')['Salary'].mean()
print(df_group)

Original Data:
       Name   Age      City   Salary
0    Alice  25.0  New York  50000.0
1      Bob   NaN    London  60000.0
2  Charlie  30.0      None      NaN
3    David  40.0     Paris  80000.0
4      Eve   NaN    Berlin  90000.0
5    Alice  25.0  New York  50000.0
6  Charlie  30.0      None      NaN

    Name   Age      City   Salary
0  Alice  25.0  New York  50000.0
1    Bob   NaN    London  60000.0
3  David  40.0     Paris  80000.0
4    Eve   NaN    Berlin  90000.0
5  Alice  25.0  New York  50000.0
    Name   Age      City   Salary
0  Alice  25.0  New York  50000.0
1    Bob  30.0    London  60000.0
3  David  40.0     Paris  80000.0
4    Eve  30.0    Berlin  90000.0
  Employee_Name  Employee_Age      City   Salary
0         Alice            25  New York  50000.0
1           Bob            30    London  60000.0
3         David            40     Paris  80000.0
4           Eve            30    Berlin  90000.0
  Employee_Name  Employee_Age      City   Salary
0         Alice            25  New York  50000.0
1           Bob            30    London  60000.0
3         David            40     Paris  80000.0
4           Eve            30    Berlin  90000.0
  Employee_Name  Employee_Age      City   Salary   Bonus
0         Alice            25  New York  50000.0  5000.0
1           Bob            30    London  60000.0  6000.0
3         David            40     Paris  80000.0  8000.0
4           Eve            30    Berlin  90000.0  9000.0
  Employee_Name  Employee_Age      City   Salary   Bonus
4           Eve            30    Berlin  90000.0  9000.0
3         David            40     Paris  80000.0  8000.0
1           Bob            30    London  60000.0  6000.0
0         Alice            25  New York  50000.0  5000.0
City
Berlin      90000.0
London      60000.0
New York    50000.0
Paris       80000.0
Name: Salary, dtype: float64

In [4]:
import pandas as pd

# Sample dataset of products
data = {
    "Product": ["Laptop", "Phone", "Tablet", "Monitor", "Keyboard", "Laptop", "Tablet"],
    "Price": [800, 500, None, 300, None, 800, None],
    "Category": ["Electronics", "Electronics", None, "Electronics", "Accessories", "Electronics", None],
    "Stock": [50, 100, None, 30, 200, 50, None]
}

df = pd.DataFrame(data)
print("Original Data:\n", df, "\n")

# Drop rows with missing Stock values
df = df.dropna(subset=['Stock'])
print("After dropping missing Stock:\n", df, "\n")

# Fill missing Price with mean, Category with "Misc"
df['Price'] = df['Price'].fillna(df['Price'].mean())
df['Category'] = df['Category'].fillna("Misc")

Original Data:
     Product  Price     Category  Stock
0    Laptop  800.0  Electronics   50.0
1     Phone  500.0  Electronics  100.0
2    Tablet    NaN         None    NaN
3   Monitor  300.0  Electronics   30.0
4  Keyboard    NaN  Accessories  200.0
5    Laptop  800.0  Electronics   50.0
6    Tablet    NaN         None    NaN

After dropping missing Stock:
     Product  Price     Category  Stock
0    Laptop  800.0  Electronics   50.0
1     Phone  500.0  Electronics  100.0
3   Monitor  300.0  Electronics   30.0
4  Keyboard    NaN  Accessories  200.0
5    Laptop  800.0  Electronics   50.0

product details

In [5]:
import pandas as pd

# Sample dataset of products
data = {
    "Product": ["Laptop", "Phone", "Tablet", "Monitor", "Keyboard", "Laptop", "Tablet"],
    "Price": [800, 500, None, 300, None, 800, None],
    "Category": ["Electronics", "Electronics", None, "Electronics", "Accessories", "Electronics", None],
    "Stock": [50, 100, None, 30, 200, 50, None]
}

df = pd.DataFrame(data)
print("Original Data:\n", df, "\n")

# Drop rows with missing Stock values
df = df.dropna(subset=['Stock'])
print("After dropping missing Stock:\n", df, "\n")

# Fill missing Price with mean, Category with "Misc"
df['Price'] = df['Price'].fillna(df['Price'].mean())
df['Category'] = df['Category'].fillna("Misc")

Original Data:
     Product  Price     Category  Stock
0    Laptop  800.0  Electronics   50.0
1     Phone  500.0  Electronics  100.0
2    Tablet    NaN         None    NaN
3   Monitor  300.0  Electronics   30.0
4  Keyboard    NaN  Accessories  200.0
5    Laptop  800.0  Electronics   50.0
6    Tablet    NaN         None    NaN

After dropping missing Stock:
     Product  Price     Category  Stock
0    Laptop  800.0  Electronics   50.0
1     Phone  500.0  Electronics  100.0
3   Monitor  300.0  Electronics   30.0
4  Keyboard    NaN  Accessories  200.0
5    Laptop  800.0  Electronics   50.0

football players

In [7]:
import pandas as pd

# Sample dataset of sports players
data = {
    "Player": ["Ronaldo", "Messi", "Neymar", "Mbappe", "Salah", "Ronaldo", "Neymar"],
    "Age": [38, 36, None, 25, None, 38, None],
    "Team": ["Al-Nassr", "Inter Miami", None, "PSG", "Liverpool", "Al-Nassr", None],
    "Goals": [50, 45, None, 40, 35, 50, None]
}

df = pd.DataFrame(data)
print("Original Data:\n", df, "\n")

# Drop rows with missing Goals
df = df.dropna(subset=['Goals'])
print("After dropping missing Goals:\n", df, "\n")

# Fill missing Age with mean, Team with "Unknown"
df['Age'] = df['Age'].fillna(df['Age'].mean())
df['Team'] = df['Team'].fillna("Unknown")

# Remove duplicate rows
df = df.drop_duplicates()
print("After filling missing values & removing duplicates:\n", df, "\n")

# Rename columns
df = df.rename(columns={"Player": "Player_Name", "Age": "Player_Age"})
df['Player_Age'] = df['Player_Age'].astype(int)
print("After renaming columns:\n", df, "\n")

# Filter players with Goals > 40
df_filtered = df[df['Goals'] > 40]
print("Players with Goals > 40:\n", df_filtered, "\n")

# Add new column: Bonus = 5% of Goals
df['Bonus'] = df['Goals'] * 0.05
print("With Bonus column:\n", df, "\n")

# Sort by Goals in descending order
df = df.sort_values(by='Goals', ascending=False)
print("Sorted by Goals:\n", df, "\n")

# Group by Team and calculate average Goals
df_group = df.groupby

Original Data:
     Player   Age         Team  Goals
0  Ronaldo  38.0     Al-Nassr   50.0
1    Messi  36.0  Inter Miami   45.0
2   Neymar   NaN         None    NaN
3   Mbappe  25.0          PSG   40.0
4    Salah   NaN    Liverpool   35.0
5  Ronaldo  38.0     Al-Nassr   50.0
6   Neymar   NaN         None    NaN

After dropping missing Goals:
     Player   Age         Team  Goals
0  Ronaldo  38.0     Al-Nassr   50.0
1    Messi  36.0  Inter Miami   45.0
3   Mbappe  25.0          PSG   40.0
4    Salah   NaN    Liverpool   35.0
5  Ronaldo  38.0     Al-Nassr   50.0

After filling missing values & removing duplicates:
     Player    Age         Team  Goals
0  Ronaldo  38.00     Al-Nassr   50.0
1    Messi  36.00  Inter Miami   45.0
3   Mbappe  25.00          PSG   40.0
4    Salah  34.25    Liverpool   35.0

After renaming columns:
   Player_Name  Player_Age         Team  Goals
0     Ronaldo          38     Al-Nassr   50.0
1       Messi          36  Inter Miami   45.0
3      Mbappe          25          PSG   40.0
4       Salah          34    Liverpool   35.0

Players with Goals > 40:
   Player_Name  Player_Age         Team  Goals
0     Ronaldo          38     Al-Nassr   50.0
1       Messi          36  Inter Miami   45.0

With Bonus column:
   Player_Name  Player_Age         Team  Goals  Bonus
0     Ronaldo          38     Al-Nassr   50.0   2.50
1       Messi          36  Inter Miami   45.0   2.25
3      Mbappe          25          PSG   40.0   2.00
4       Salah          34    Liverpool   35.0   1.75

Sorted by Goals:
   Player_Name  Player_Age         Team  Goals  Bonus
0     Ronaldo          38     Al-Nassr   50.0   2.50
1       Messi          36  Inter Miami   45.0   2.25
3      Mbappe          25          PSG   40.0   2.00
4       Salah          34    Liverpool   35.0   1.75

product details

In [8]:
import pandas as pd

# Sample dataset of products
data = {
    "Product": ["Laptop", "Phone", "Tablet", "Monitor", "Keyboard", "Laptop", "Tablet"],
    "Price": [800, 500, None, 300, None, 800, None],
    "Category": ["Electronics", "Electronics", None, "Electronics", "Accessories", "Electronics", None],
    "Stock": [50, 100, None, 30, 200, 50, None]
}

df = pd.DataFrame(data)
print("Original Data:\n", df, "\n")

# Drop rows with missing Stock values
df = df.dropna(subset=['Stock'])
print("After dropping missing Stock:\n", df, "\n")

# Fill missing Price with mean, Category with "Misc"
df['Price'] = df['Price'].fillna(df['Price'].mean())
print(df)
df['Category'] = df['Category'].fillna("Misc")
print(df)
df['Price'] = df['Price'].astype(int)
print(df)
df = df.sort_values(by='Product', ascending=False)
print(df)
df = df.drop_duplicates()
print(df)

Original Data:
     Product  Price     Category  Stock
0    Laptop  800.0  Electronics   50.0
1     Phone  500.0  Electronics  100.0
2    Tablet    NaN         None    NaN
3   Monitor  300.0  Electronics   30.0
4  Keyboard    NaN  Accessories  200.0
5    Laptop  800.0  Electronics   50.0
6    Tablet    NaN         None    NaN

After dropping missing Stock:
     Product  Price     Category  Stock
0    Laptop  800.0  Electronics   50.0
1     Phone  500.0  Electronics  100.0
3   Monitor  300.0  Electronics   30.0
4  Keyboard    NaN  Accessories  200.0
5    Laptop  800.0  Electronics   50.0

    Product  Price     Category  Stock
0    Laptop  800.0  Electronics   50.0
1     Phone  500.0  Electronics  100.0
3   Monitor  300.0  Electronics   30.0
4  Keyboard  600.0  Accessories  200.0
5    Laptop  800.0  Electronics   50.0
    Product  Price     Category  Stock
0    Laptop  800.0  Electronics   50.0
1     Phone  500.0  Electronics  100.0
3   Monitor  300.0  Electronics   30.0
4  Keyboard  600.0  Accessories  200.0
5    Laptop  800.0  Electronics   50.0
    Product  Price     Category  Stock
0    Laptop    800  Electronics   50.0
1     Phone    500  Electronics  100.0
3   Monitor    300  Electronics   30.0
4  Keyboard    600  Accessories  200.0
5    Laptop    800  Electronics   50.0
    Product  Price     Category  Stock
1     Phone    500  Electronics  100.0
3   Monitor    300  Electronics   30.0
0    Laptop    800  Electronics   50.0
5    Laptop    800  Electronics   50.0
4  Keyboard    600  Accessories  200.0
    Product  Price     Category  Stock
1     Phone    500  Electronics  100.0
3   Monitor    300  Electronics   30.0
0    Laptop    800  Electronics   50.0
4  Keyboard    600  Accessories  200.0